#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "8a60ab2e-95ad-43ae-8d6f-376144dfa49c"
        name       = "region_interior"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-FE.module.client-roles.keycloak_role.ROLES["region_northern"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "8010ec54-9206-4718-9893-9f41693f6220"
        name       = "region_northern"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-FE.module.client-roles.keycloak_role.ROLES["region_vancouver_coastal"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "43cc7b0d-1ae2-4d18-9200-3366713a5d55"
        name       = "region_vancouver_coastal"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-FE.module.client-roles.keycloak_role.ROLES["region_vancouver_island"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "7523eaca-3a9d-4992-b7c1-dc702d9e9ae2"
        name       = "region_vancouver_island"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-FE.module.client-roles.keycloak_role.ROLES["superuser"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "46a4f436-dbb9-447f-a625-5a776141e9b7"
        name       = "superuser"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-hcap-fe"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "24735f22-a0d0-4e75-9e88-966e532a4366"
        name       = "view-client-hcap-fe"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "PRIME Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-prime-application-local"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id        = (known after apply)
      + name      = "view-client-prime-application-local"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-prime-application-test"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id        = (known after apply)
      + name      = "view-client-prime-application-test"
      + realm_id  = "moh_applications"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*